title: "Injection Sql"
status: test
description: "Detect Sql Injection by keyword"
author: Mathieu Vagnerre
logsource:
   category: webserver
   definition: 'TEST'
detection:
    keywords:
        - '=select'
        - '=union'
        - '=concat'
    condition: keywords
fields:
    - url
level: high